* MPU-6050


#+tblname: MPU6050_address
| Device                           | address decimal | address hex |                             |
|----------------------------------+-----------------+-------------+-----------------------------|
| MPU6050 I2C Address              |             104 |        0x68 |                             |
| reset address                    |             107 |        0x6B | set 0                       |
| read accelaration (ACCEL_XOUT_H) |              59 |        0x3B | 6 bytes (XYZ_16bit_MSB/LSB) |
|----------------------------------+-----------------+-------------+-----------------------------|
| ACCEL_CONFIG register            |              28 |        0x1C | change scale                |
| set +/- 8g                       |              16 |        0x10 |                             |
|                                  |                 |             |                             |
#+TBLFM: @3$2='(format "%d" #x6B)::@4$2='(format "%d" #x3B)::@5$2='(format "%d" #x1C)::@6$2='(format "%d" #x10)

#+name: MPU_6050
#+begin_src lisp :tangle yes
(defun reset_MPU6050 ()
  (with-i2c (str 104) 
    (write-byte 104 str)
    (write-byte 0 str)
    ))

(defun MPU6050_set_scale_8g ()
  (with-i2c (str 104) 
    (write-byte 28 str)
    (write-byte 16 str)
    ))

(defun read_MPU6050 ()
  (with-i2c (str 104) 
    (write-byte 59 str)
    (restart-i2c str 6) 
    (list
     (read-byte str)
     (read-byte str)
     (read-byte str)
     (read-byte str)
     (read-byte str)
     (read-byte str)))
  )

(defun scan_MPU6050_long () 
  (dotimes (p 20)
    (with-i2c (str 104) 
      (write-byte 59 str)
      )
    (let* ((r (read_MPU6050))
	   (x0 (nth 0 r))
	   (y0 (nth 2 r))
	   (z0 (nth 4 r))
	   )
    (format t "X:~d  Y:~d  Z:~d~%" x0 y0 z0)
    )
))

(defun scan_MPU6050 () 
    (format nil "~{ ~d ~}" (read_MPU6050))
)

  #+end_src




* GY-271

(with-i2c (str #x68) 
  (write-byte 0 str) 
  (write-byte 1 str) 
  (write-byte 2 str))
  
(with-i2c (str 0x0D) 
(write-byte 0x0B str)
(write-byte 0x01 str)
(write-byte 0x09 str)
(write-byte 0x1D str)
)
  
(with-i2c (str 13) 
(write-byte 11 str)
(write-byte 1 str)
(write-byte 9 str)
(write-byte 29 str)
)


(with-i2c (str 13) 
(write-byte 0 str)
)

#+begin_src lisp
(defvar i 100)
(defun mag (i)
(if (< i 1) 0
(progn
(setf i (- i 1))
(prin1 (get_magneto))
(format t "~%")
(mag i)
))))
#+end_src

#+name: get_magneto
#+begin_src lisp :tangle yes
(defun get_magneto ()
  (with-i2c (str 13) 
	    (write-byte 0 str)
	    (restart-i2c str 6)
	    (list
	     (read-byte str)
	     (read-byte str)
	     (read-byte str)
	     (read-byte str)
	     (read-byte str)
	     (read-byte str))))
#+end_src

#+RESULTS: get_magneto
: get_magneto



#+begin_src emacs-lisp :var i=get_magneto
(format t i)
#+end_src 


#+name: hex2decimal
#+begin_src emacs-lisp :results table
(concat
(format "Compass|0x0D:|%d\n" #x0D)(format "||0x0B:|%d|\n" #x0B)(format "||0x1D:|%d|\n" #x1D)
(format "||0x68:|%d|" #x68)
)
#+end_src

#+RESULTS: hex2decimal
| Compass | 0x0D: |  13 |   |
|         | 0x0B: |  11 |   |
|         | 0x1D: |  29 |   |
|         | 0x68: | 104 |   |

#+name: decimal2hex
#+begin_src emacs-lisp
(concat
(format "0x0D:%d\n" #x0D)
(format "0x0B:%d\n" #x0B)
(format "0x1D:%d" #x1D)
)
#+end_src

#+RESULTS:
: 0x0D:13
: 0x0B:11
: 0x1D:29

(defun get ()
  (with-i2c (str 13 3) 
    (list
     (read-byte str)
     (read-byte str)
     (read-byte str))))


